app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "price", "published_date", "created_at", "updated_at") VALUES ('', '', NULL, NULL, '2025-01-28 07:18:42.538734', '2025-01-28 07:18:42.538734') RETURNING "id"

  def destroy
    @book.destroy!
---
DELETE FROM "books" WHERE "books"."id" = 1

    def set_book
      @book = Book.find(params[:id])  # ✅ Fixed
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1